<a href="https://colab.research.google.com/github/YeonKang/Python-for-Machine-Learning/blob/main/Lec2_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**import pandas**

In [ ]:
import pandas as pd

**get data**

In [ ]:
data_url ='https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data' #Data URL
#data_url = './housing.data'
df_data = pd.read_csv(data_url,sep='\s+',header=None) #load csv type data  #sep = criteria for dividing data, \s -> empty space

In [ ]:
df_data.head() #print the first five lines

        0     1     2   3      4      5   ...  8      9     10      11    12    13
0  0.00632  18.0  2.31   0  0.538  6.575  ...   1  296.0  15.3  396.90  4.98  24.0
1  0.02731   0.0  7.07   0  0.469  6.421  ...   2  242.0  17.8  396.90  9.14  21.6
2  0.02729   0.0  7.07   0  0.469  7.185  ...   2  242.0  17.8  392.83  4.03  34.7
3  0.03237   0.0  2.18   0  0.458  6.998  ...   3  222.0  18.7  394.63  2.94  33.4
4  0.06905   0.0  2.18   0  0.458  7.147  ...   3  222.0  18.7  396.90  5.33  36.2

[5 rows x 14 columns]

In [ ]:
df_data.columns = ['CRIM','ZN','INDUS','CHAS','NOX','RM','AGE','DIS','RAD','TAX','PTRATIO','B','LSTAT','MEDV'] #name the Column Header
df_data.head()

      CRIM    ZN  INDUS  CHAS    NOX  ...    TAX  PTRATIO       B  LSTAT  MEDV
0  0.00632  18.0   2.31     0  0.538  ...  296.0     15.3  396.90   4.98  24.0
1  0.02731   0.0   7.07     0  0.469  ...  242.0     17.8  396.90   9.14  21.6
2  0.02729   0.0   7.07     0  0.469  ...  242.0     17.8  392.83   4.03  34.7
3  0.03237   0.0   2.18     0  0.458  ...  222.0     18.7  394.63   2.94  33.4
4  0.06905   0.0   2.18     0  0.458  ...  222.0     18.7  396.90   5.33  36.2

[5 rows x 14 columns]

In [ ]:
df_data.values

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

**Pandas Series**

In [ ]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [ ]:
list_data = [1,2,3,4,5]
example_obj = Series(data = list_data)
example_obj
#result -> index, data
#           data type

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
list_data = [1,2,3,4,5]
list_name = ["a","b","c","d","e"]
example_obj = Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data")

In [ ]:
example_obj["a"]

1.0

In [ ]:
example_obj["a"] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [ ]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a","b","c","d","e","f","g","h"]
series_obj_1 = Series(dict_data_1, index=indexes)
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

**Dataframe overview**

In [ ]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [ ]:
raw_data = {'first_name': ['Jason','Mplly','Tina','Jake','Amy'],
            'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],
            'age' : [42,52,36,24,73],
            'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [ ]:
DataFrame(raw_data,columns=["age","city"])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [ ]:
DataFrame(raw_data,columns=["first_name","last_name","age","city","debt"])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Mplly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [ ]:
df = DataFrame(raw_data,columns=["first_name","last_name","age","city","debt"])
df.first_name

0    Jason
1    Mplly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [ ]:
df["first_name"]

0    Jason
1    Mplly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [ ]:
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Mplly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [ ]:
df.T #Transpose

                        0          1      2        3       4
first_name          Jason      Mplly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [ ]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Mplly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [ ]:
df.to_csv()

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Mplly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [ ]:
del df["debt"]
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [ ]:
df.loc[1] #loc[] : index location

first_name        Mplly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [ ]:
df["age"].iloc[1:] #iloc[] : index position

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [ ]:
s = pd.Series(np.nan,index=[49,48,47,46,45,1,2,3,4,5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [ ]:
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [ ]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

**Data Selection**

In [ ]:
import pandas as pd
import numpy as np
raw_data = {'first_name': ['Jason','Mplly','Tina','Jake','Amy'],
            'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],
            'age' : [42,52,36,24,73],
            'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [ ]:
df["first_name"].head(3)

0    Jason
1    Mplly
2     Tina
Name: first_name, dtype: object

In [ ]:
df[["first_name","last_name","city"]].head(3)

  first_name last_name           city
0      Jason    Miller  San Francisco
1      Mplly  Jacobson      Baltimore
2       Tina       Ali          Miami

In [ ]:
df[:3]

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami

In [ ]:
df["city"][:3]

0    San Francisco
1        Baltimore
2            Miami
Name: city, dtype: object

In [ ]:
age_series = df["age"]
age_series[:3]

0    42
1    52
2    36
Name: age, dtype: int64

In [ ]:
age_series[[0,1,2]]

0    42
1    52
2    36
Name: age, dtype: int64

In [ ]:
age_series[age_series>40] #boolean index

0    42
1    52
4    73
Name: age, dtype: int64

In [ ]:
df[["first_name","last_name"]][:2] #column & index number

  first_name last_name
0      Jason    Miller
1      Mplly  Jacobson

In [ ]:
df.loc[[0,1],["first_name","last_name"]] #index name & column

  first_name last_name
0      Jason    Miller
1      Mplly  Jacobson

In [ ]:
df.iloc[:2,:2] #index number & column number

  first_name last_name
0      Jason    Miller
1      Mplly  Jacobson

**index reset**

In [ ]:
df.index = list(range(5,10))
df.head()

  first_name last_name  age           city
5      Jason    Miller   42  San Francisco
6      Mplly  Jacobson   52      Baltimore
7       Tina       Ali   36          Miami
8       Jake    Milner   24        Douglas
9        Amy     Cooze   73         Boston

**Data drop**

In [ ]:
import pandas as pd
import numpy as np
raw_data = {'first_name': ['Jason','Mplly','Tina','Jake','Amy'],
            'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],
            'age' : [42,52,36,24,73],
            'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Mplly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [ ]:
df.drop(1) #drop using index number

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [ ]:
df.drop([1,2])

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [ ]:
df.drop("city",axis=1) #drop using column name & axis number

  first_name last_name  age
0      Jason    Miller   42
1      Mplly  Jacobson   52
2       Tina       Ali   36
3       Jake    Milner   24
4        Amy     Cooze   73

**Series operation**

In [ ]:
s1 = Series(range(1,6),index=list("abcde"))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
s2 = Series(range(5,11),index=list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [ ]:
s1.add(s2) #calculation based on index

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [ ]:
s1 + s2 #if there is no overlapping index, return as NaN value

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

**Dataframe operation**

In [ ]:
df1 = DataFrame(np.arange(9).reshape(3,3),columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [ ]:
df2 = DataFrame(np.arange(16).reshape(4,4),columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [ ]:
df1.add(df2,fill_value=0) #empty values ​​can be filled with zeros to prevent NaN values ​​from coming out

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

**Series + Dataframe**

In [ ]:
df = DataFrame(np.arange(16).reshape(4,4),columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
s = Series(np.arange(10,14),index=list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int64

In [ ]:
df + s #broadcasting based on column

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

**map & lambda for series**

In [ ]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
s1.map(lambda x:x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [ ]:
z = {1:'A',2:'B',3:'C'}
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [ ]:
s2 = Series(np.arange(10,20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [ ]:
raw_data = {'first_name': ['Jason','Mplly','Tina','Jake','Amy'],
            'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],
            'age' : [42,52,36,24,73],
            'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston'],
            'sex':['male','male','female','male','female']}
df = pd.DataFrame(raw_data, columns=['first_name','last_name','age','city','sex'])
df.head()

  first_name last_name  age           city     sex
0      Jason    Miller   42  San Francisco    male
1      Mplly  Jacobson   52      Baltimore    male
2       Tina       Ali   36          Miami  female
3       Jake    Milner   24        Douglas    male
4        Amy     Cooze   73         Boston  female

In [ ]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [ ]:
df["sex_code"] = df.sex.map({"male":0,"female":1})
df.head(5)

  first_name last_name  age           city     sex  sex_code
0      Jason    Miller   42  San Francisco    male         0
1      Mplly  Jacobson   52      Baltimore    male         0
2       Tina       Ali   36          Miami  female         1
3       Jake    Milner   24        Douglas    male         0
4        Amy     Cooze   73         Boston  female         1

In [ ]:
df.sex.replace({"male":0,"female":1}).head()

0    0
1    0
2    1
3    0
4    1
Name: sex, dtype: int64

In [ ]:
df.sex.head(5)

0      male
1      male
2    female
3      male
4    female
Name: sex, dtype: object

In [ ]:
df.sex.replace(["male","female"],[0,1],inplace=True)
df

  first_name last_name  age           city  sex  sex_code
0      Jason    Miller   42  San Francisco    0         0
1      Mplly  Jacobson   52      Baltimore    0         0
2       Tina       Ali   36          Miami    1         1
3       Jake    Milner   24        Douglas    0         0
4        Amy     Cooze   73         Boston    1         1

In [ ]:
del df["sex_code"]
df

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Francisco    0
1      Mplly  Jacobson   52      Baltimore    0
2       Tina       Ali   36          Miami    1
3       Jake    Milner   24        Douglas    0
4        Amy     Cooze   73         Boston    1

**Group by** (Basic)

In [ ]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [ ]:
df.groupby("Team")["Points"].sum() #df.groupby("Reference column")["Applied column"].function()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

**Hierarchical index**

In [ ]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [ ]:
h_index = df.groupby(["Team", "Year"])["Points"].sum()
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [ ]:
h_index.index

MultiIndex([('Devils', 2014),
            ('Devils', 2015),
            ( 'Kings', 2014),
            ( 'Kings', 2016),
            ( 'Kings', 2017),
            ('Riders', 2014),
            ('Riders', 2015),
            ('Riders', 2016),
            ('Riders', 2017),
            ('Royals', 2014),
            ('Royals', 2015),
            ( 'kings', 2015)],
           names=['Team', 'Year'])

In [ ]:
h_index["Devils":"Kings"]

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Name: Points, dtype: int64

In [ ]:
h_index.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0    NaN  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN
kings     NaN  812.0    NaN    NaN

In [ ]:
h_index.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
      kings     812
Name: Points, dtype: int64

In [ ]:
h_index.sum(level=0)

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [ ]:
h_index.sum(level=1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

**Groupby** (grouped)

In [ ]:
grouped = df.groupby("Team")

In [ ]:
for name,group in grouped:
    print (type(name))
    print (type(group))

<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>

In [ ]:
grouped.get_group("Riders")

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690

**Aggregation**

In [ ]:
grouped.agg(min)

        Rank  Year  Points
Team
Devils     2  2014     673
Kings      1  2014     741
Riders     1  2014     690
Royals     1  2014     701
kings      4  2015     812

In [ ]:
import numpy as np
grouped.agg(np.mean)

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [ ]:
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

**Transformation**

In [ ]:
score = lambda x: (x - x.mean()) / x.std()
grouped.transform(score)

        Rank      Year    Points
0  -1.500000 -1.161895  1.284327
1   0.500000 -0.387298  0.302029
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   1.154701 -1.091089 -0.860862
5        NaN       NaN       NaN
6  -0.577350  0.218218 -0.236043
7  -0.577350  0.872872  1.096905
8   0.500000  0.387298 -0.770596
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  1.161895 -0.815759

In [ ]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [ ]:
df.groupby('Team').filter(lambda x: x["Points"].max() > 800)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
5    kings     4  2015     812
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690